tap "hashicorp/tap"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "libsql/sqld"
tap "shopify/shopify"
tap "tursodatabase/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Vector graphics library with cross-device output support
brew "cairo"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# OpenType text shaping engine
brew "harfbuzz"
# Platform built on V8 to build network applications
brew "node"
# JavaScript implementation of a Sass compiler
brew "node-sass"
# Development kit for the Java programming language
brew "openjdk@17"
# General-purpose scripting language
brew "php"
# Object-relational database system
brew "postgresql@14"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Tracks most-used directories to make cd smarter
brew "z"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Informative git prompt for zsh
brew "zsh-git-prompt"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Terraform
brew "hashicorp/tap/terraform"
# A CLI tool to build for the Shopify platform
brew "shopify/shopify/shopify-cli"
brew "tursodatabase/tap/turso"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Collaboration platform for API development
cask "postman"
# Open-source code editor
cask "visual-studio-code"
# Nerd Fonts - Code New Roman
cask "font-code-new-roman-nerd-font"
